const cookingDB = {
  "Варити": {
    "🥚 Яйця": {
      "Курячі": {
        "Холодна вода (з холодильника)": {
          "Некруте (рідкий жовток)": {
            "Великий": 240,
            "Середній": 270,
            "Малий": 300,
            "tip": "Варіть яйця, а потім одразу покладіть у крижану воду, щоб легко чистити."
          },
          "В мішечок (тягучий жовток)": {
            "Великий": 330,
            "Середній": 360,
            "Малий": 420,
            "tip": "Ідеально для сніданку з тостами."
          },
          "Круте (твердий жовток)": {
            "Великий": 540,
            "Середній": 600,
            "Малий": 720,
            "tip": "Не варіть довше 10 хвилин, інакше жовток посіріє."
          }
        },
        "Окріп (кімнатна температура)": {
          "Некруте (рідкий жовток)": {
            "Великий": 330,
            "Середній": 360,
            "Малий": 390,
            "tip": "Опускайте яйця ложкою дуже обережно."
          },
          "Круте (твердий жовток)": {
            "Великий": 540,
            "Середній": 600,
            "Малий": 660,
            "tip": "Ідеально для салатів."
          }
        },
        "Некруте (в смятку)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "В мішечок": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Круте (в круту)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Пашот": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        }
      },
      "Перепелині": {
        "Цілі": {
          "Некруте": {
            "Великий": 90,
            "Середній": 120,
            "Малий": 150,
            "tip": "Дуже ніжні, обережно очищуйте."
          },
          "Круте": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Відмінний інгредієнт для святкових салатів."
          }
        },
        "Звичайні (круті / некруті)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        }
      },
      "Страусині": {
        "Цілі": {
          "Некруте": {
            "Великий": 2700,
            "Середній": 3000,
            "Малий": 3600,
            "tip": "45 хвилин! Будьте готові почекати."
          },
          "Круте": {
            "Великий": 4500,
            "Середній": 5400,
            "Малий": 6000,
            "tip": "Знадобиться молоток, щоб розбити шкарлупу."
          }
        },
        "Ціле (велике)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        }
      }
    },
    "🍝 Макаронні вироби та тісто": {
      "Спагеті": {
        "Звичайні": {
          "Аль денте (трохи тверді)": {
            "Великий": 420,
            "Середній": 480,
            "Малий": 540,
            "tip": "Справжній італійський стиль."
          },
          "Стандартна (повна готовність)": {
            "Великий": 540,
            "Середній": 600,
            "Малий": 660,
            "tip": "Найпопулярніший варіант."
          },
          "М'які (для запіканок)": {
            "Великий": 720,
            "Середній": 800,
            "Малий": 900,
            "tip": "Макарони стануть дуже м'якими."
          }
        }
      },
      "Пенне (Пір'я)": {
        "Звичайні": {
          "Аль денте": {
            "Великий": 540,
            "Середній": 600,
            "Малий": 660,
            "tip": "Чудово утримують соус всередині."
          },
          "Стандартна": {
            "Великий": 660,
            "Середній": 720,
            "Малий": 800,
            "tip": "Класичне приготування."
          }
        }
      },
      "Фарфалле (Метелики)": {
        "Звичайні": {
          "Аль денте": {
            "Великий": 600,
            "Середній": 660,
            "Малий": 720,
            "tip": "Через товстий центр варяться довше."
          },
          "Стандартна": {
            "Великий": 720,
            "Середній": 800,
            "Малий": 900,
            "tip": "Добре поєднуються з вершковими соусами."
          }
        }
      },
      "Класичні макарони (з твердих сортів)": {
        "Спагеті (Spaghetti)": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        },
        "Пенне / Пір'я (Penne)": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        },
        "Фарфалле / Метелики (Farfalle)": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        },
        "Фузіллі / Спіральки (Fusilli)": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        },
        "Феттуччіні / Гнізда (Fettuccine)": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        },
        "Ріжки (Maccheroni)": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        },
        "Лазанья (листи для відварювання)": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        }
      },
      "Азійська локшина": {
        "Удон (пшенична)": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        },
        "Соба (гречана)": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        },
        "Рисова локшина": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        },
        "Фунчоза (скляна локшина)": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        },
        "Яєчна локшина": {
          "Аль денте (злегка тверді)": {
            "Великий": 336,
            "Середній": 384,
            "Малий": 480,
            "tip": "Справжній італійський стиль."
          },
          "М'які (повністю готові)": {
            "Великий": 480,
            "Середній": 576,
            "Малий": 672,
            "tip": "Добре підходять для запіканок."
          }
        }
      },
      "Напівфабрикати з тіста": {
        "Пельмені (з м'ясом)": {
          "Стандартна готовність": {
            "Великий": 384,
            "Середній": 480,
            "Малий": 576,
            "tip": "Оптимальний час приготування."
          }
        },
        "Вареники з картоплею": {
          "Стандартна готовність": {
            "Великий": 384,
            "Середній": 480,
            "Малий": 576,
            "tip": "Оптимальний час приготування."
          }
        },
        "Вареники з сиром (солодкі/солоні)": {
          "Стандартна готовність": {
            "Великий": 384,
            "Середній": 480,
            "Малий": 576,
            "tip": "Оптимальний час приготування."
          }
        },
        "Вареники з вишнею": {
          "Стандартна готовність": {
            "Великий": 384,
            "Середній": 480,
            "Малий": 576,
            "tip": "Оптимальний час приготування."
          }
        },
        "Хінкалі": {
          "Стандартна готовність": {
            "Великий": 384,
            "Середній": 480,
            "Малий": 576,
            "tip": "Оптимальний час приготування."
          }
        },
        "Равіолі": {
          "Стандартна готовність": {
            "Великий": 384,
            "Середній": 480,
            "Малий": 576,
            "tip": "Оптимальний час приготування."
          }
        },
        "Галушки": {
          "Стандартна готовність": {
            "Великий": 384,
            "Середній": 480,
            "Малий": 576,
            "tip": "Оптимальний час приготування."
          }
        }
      }
    },
    "🌾 Крупи та злаки": {
      "Рис білий": {
        "Довгозерний": {
          "Розсипчастий": {
            "Великий": 900,
            "Середній": 1020,
            "Малий": 1200,
            "tip": "Співвідношення води 1:2. Не відкривайте кришку!"
          },
          "В'язкий (для каші)": {
            "Великий": 1200,
            "Середній": 1380,
            "Малий": 1500,
            "tip": "Більше води, частіше помішуйте."
          }
        }
      },
      "Гречка": {
        "Ядриця": {
          "Розсипчаста": {
            "Великий": 780,
            "Середній": 900,
            "Малий": 1020,
            "tip": "Промийте і злегка обсмажте перед варінням для аромату."
          }
        },
        "Звичайна (ядриця)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Зелена (необсмажена)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Проділ (січка)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "У пакетиках для варіння": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        }
      },
      "Вівсянка": {
        "Геркулес": {
          "Звичайна": {
            "Великий": 600,
            "Середній": 900,
            "Малий": 1200,
            "tip": "Додайте сіль навіть якщо готуєте солодку кашу."
          }
        },
        "Пластівці швидкого приготування (екстра)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Плющена традиційна (Геркулес)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Цільнозернова крупа": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        }
      },
      "Рис": {
        "Білий довгозерний": {
          "Розсипчаста": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1680,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1560,
            "Середній": 1800,
            "Малий": 2160,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Білий круглозерний": {
          "Розсипчаста": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1680,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1560,
            "Середній": 1800,
            "Малий": 2160,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Басматі": {
          "Розсипчаста": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1680,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1560,
            "Середній": 1800,
            "Малий": 2160,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Жасмин": {
          "Розсипчаста": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1680,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1560,
            "Середній": 1800,
            "Малий": 2160,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Бурий (неочищений)": {
          "Розсипчаста": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1680,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1560,
            "Середній": 1800,
            "Малий": 2160,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Дикий (чорний)": {
          "Розсипчаста": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1680,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1560,
            "Середній": 1800,
            "Малий": 2160,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Червоний": {
          "Розсипчаста": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1680,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1560,
            "Середній": 1800,
            "Малий": 2160,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Спеціальний для суші (короткозерний)": {
          "Розсипчаста": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1680,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1560,
            "Середній": 1800,
            "Малий": 2160,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Арборіо (для різотто)": {
          "Розсипчаста": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1680,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1560,
            "Середній": 1800,
            "Малий": 2160,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Пропарений": {
          "Розсипчаста": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1680,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1560,
            "Середній": 1800,
            "Малий": 2160,
            "tip": "Додайте більше води і часто помішуйте."
          }
        }
      },
      "Булгур": {
        "Дрібний (коатлик)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Середній": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Великий (пілавлік)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        }
      },
      "Кускус": {
        "Звичайний (дрібний)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Птітім (ізраїльський, великі кульки)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        }
      },
      "Кіноа": {
        "Біла": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Червона": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Чорна": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Мікс (триколірна)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        }
      },
      "Пшоно": {
        "Звичайне шліфоване": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        }
      },
      "Кукурудзяна крупа": {
        "Дрібного помелу (для поленти та баноша)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Грубого помелу": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        }
      },
      "Манка": {
        "Традиційна (марка М)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Семуліна (із твердих сортів пшениці)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        }
      },
      "Перловка": {
        "Звичайна ячмінна": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        },
        "Голландка (сильно шліфована)": {
          "Розсипчаста": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1260,
            "tip": "Не відкривайте кришку під час варіння."
          },
          "В'язка (для каші)": {
            "Великий": 1170,
            "Середній": 1350,
            "Малий": 1620,
            "tip": "Додайте більше води і часто помішуйте."
          }
        }
      }
    },
    "🥔 Овочі та коренеплоди": {
      "Картопля": {
        "Ціла (в мундирі)": {
          "Стандартна": {
            "Великий": 1200,
            "Середній": 1500,
            "Малий": 1800,
            "tip": "Ідеально для салатів. Перевіряйте готовність ножем."
          }
        },
        "Очищена кубиками": {
          "Для пюре": {
            "Великий": 900,
            "Середній": 1200,
            "Малий": 1500,
            "tip": "Вода має ледь покривати картоплю."
          }
        },
        "В мундирі (ціла)": {
          "Хрусткі (Бланшовані)": {
            "Великий": 360,
            "Середній": 480,
            "Малий": 600,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1800,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Очищена (ціла)": {
          "Хрусткі (Бланшовані)": {
            "Великий": 360,
            "Середній": 480,
            "Малий": 600,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1800,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Шматочками / кубиками (для супу)": {
          "Хрусткі (Бланшовані)": {
            "Великий": 360,
            "Середній": 480,
            "Малий": 600,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1800,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Молода дрібна": {
          "Хрусткі (Бланшовані)": {
            "Великий": 360,
            "Середній": 480,
            "Малий": 600,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 1200,
            "Середній": 1440,
            "Малий": 1800,
            "tip": "Легко розминаються виделкою."
          }
        }
      },
      "Броколі": {
        "Суцвіття": {
          "Хрусткі (бланшовані)": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Одразу киньте в крижану воду, щоб зберегти колір!"
          },
          "М'які (для супу)": {
            "Великий": 360,
            "Середній": 420,
            "Малий": 480,
            "tip": "Овоч втратить яскравий колір, але стане ніжним."
          }
        }
      },
      "Морква": {
        "Ціла очищена": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Нарізана кубиками або соломкою": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        }
      },
      "Буряк": {
        "Цілий дрібний": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Цілий великий": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Нарізаний або натертий": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        }
      },
      "Капуста": {
        "Броколі (суцвіття)": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Цвітна капуста (суцвіття)": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Брюссельська (міні-качанчики)": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Білокачанна (нарізана шматочками / нашаткована)": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        }
      },
      "Кукурудзяні качани": {
        "Молоді цукрові": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Старі / кормові": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Зерна кукурудзи (свіжі/морожені)": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        }
      },
      "Спаржа (Asparagus)": {
        "Зелена": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Біла": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        }
      },
      "Кабачки та гарбузові": {
        "Кабачок / Цукіні (кільцями)": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Гарбуз (кубиками)": {
          "Хрусткі (Бланшовані)": {
            "Великий": 270,
            "Середній": 360,
            "Малий": 450,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Легко розминаються виделкою."
          }
        }
      }
    },
    "🥩 М'ясо та птиця": {
      "Курка": {
        "Філе": {
          "Для салату (ніжне)": {
            "Великий": 900,
            "Середній": 1200,
            "Малий": 1500,
            "tip": "Опускайте в окріп, щоб зберегти соки."
          },
          "Для бульйону": {
            "Великий": 1800,
            "Середній": 2400,
            "Малий": 3000,
            "tip": "Кладіть у холодну воду, щоб м'ясо віддало смак."
          }
        },
        "Куряче філе (грудка)": {
          "Ніжне (для салату)": {
            "Великий": 1800,
            "Середній": 2160,
            "Малий": 2700,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 2700,
            "Середній": 3240,
            "Малий": 3960,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Гомілки / Стегна": {
          "Ніжне (для салату)": {
            "Великий": 1800,
            "Середній": 2160,
            "Малий": 2700,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 2700,
            "Середній": 3240,
            "Малий": 3960,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Курячі крильця": {
          "Ніжне (для салату)": {
            "Великий": 1800,
            "Середній": 2160,
            "Малий": 2700,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 2700,
            "Середній": 3240,
            "Малий": 3960,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Ціла тушка бройлера": {
          "Ніжне (для салату)": {
            "Великий": 1800,
            "Середній": 2160,
            "Малий": 2700,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 2700,
            "Середній": 3240,
            "Малий": 3960,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Домашня курка (для довгого варіння юшки)": {
          "Ніжне (для салату)": {
            "Великий": 1800,
            "Середній": 2160,
            "Малий": 2700,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 2700,
            "Середній": 3240,
            "Малий": 3960,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        }
      },
      "Яловичина": {
        "М'якоть": {
          "Для супу": {
            "Великий": 3600,
            "Середній": 5400,
            "Малий": 7200,
            "tip": "Знімайте пінку, щоб бульйон був прозорим."
          }
        }
      },
      "Індичка": {
        "Філе індички": {
          "Ніжне (для салату)": {
            "Великий": 1800,
            "Середній": 2160,
            "Малий": 2700,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 2700,
            "Середній": 3240,
            "Малий": 3960,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Індича гомілка": {
          "Ніжне (для салату)": {
            "Великий": 1800,
            "Середній": 2160,
            "Малий": 2700,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 2700,
            "Середній": 3240,
            "Малий": 3960,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Крила": {
          "Ніжне (для салату)": {
            "Великий": 1800,
            "Середній": 2160,
            "Малий": 2700,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 2700,
            "Середній": 3240,
            "Малий": 3960,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        }
      },
      "Яловичина / Телятина": {
        "М'якоть шматком (для салатів чи борщу)": {
          "Ніжне (для салату)": {
            "Великий": 3600,
            "Середній": 4320,
            "Малий": 5400,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 5400,
            "Середній": 6480,
            "Малий": 7920,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "М'ясо на кістці (грудинка, ребра для бульйону)": {
          "Ніжне (для салату)": {
            "Великий": 3600,
            "Середній": 4320,
            "Малий": 5400,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 5400,
            "Середній": 6480,
            "Малий": 7920,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        }
      },
      "Свинина": {
        "М'якоть (балик, лопатка)": {
          "Ніжне (для салату)": {
            "Великий": 3600,
            "Середній": 4320,
            "Малий": 5400,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 5400,
            "Середній": 6480,
            "Малий": 7920,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Реберця": {
          "Ніжне (для салату)": {
            "Великий": 3600,
            "Середній": 4320,
            "Малий": 5400,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 5400,
            "Середній": 6480,
            "Малий": 7920,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Рулька (для холодцю або запікання після варіння)": {
          "Ніжне (для салату)": {
            "Великий": 3600,
            "Середній": 4320,
            "Малий": 5400,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 5400,
            "Середній": 6480,
            "Малий": 7920,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        }
      },
      "Субпродукти": {
        "Печінка куряча": {
          "Ніжне (для салату)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 1350,
            "Середній": 1620,
            "Малий": 1980,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Печінка яловича / свиняча": {
          "Ніжне (для салату)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 1350,
            "Середній": 1620,
            "Малий": 1980,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Курячі серця та шлуночки": {
          "Ніжне (для салату)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 1350,
            "Середній": 1620,
            "Малий": 1980,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Язик яловичий": {
          "Ніжне (для салату)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 1350,
            "Середній": 1620,
            "Малий": 1980,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Язик свинячий": {
          "Ніжне (для салату)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 1350,
            "Середній": 1620,
            "Малий": 1980,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        }
      },
      "Ковбасні вироби": {
        "Сосиски тонкі": {
          "Ніжне (для салату)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 1350,
            "Середній": 1620,
            "Малий": 1980,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Сардельки класичні": {
          "Ніжне (для салату)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 1350,
            "Середній": 1620,
            "Малий": 1980,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        },
        "Шпикачки": {
          "Ніжне (для салату)": {
            "Великий": 900,
            "Середній": 1080,
            "Малий": 1350,
            "tip": "Опускайте м'ясо в окріп."
          },
          "Для навару (для супу)": {
            "Великий": 1350,
            "Середній": 1620,
            "Малий": 1980,
            "tip": "Опускайте м'ясо в холодну воду і варіть на слабкому вогні."
          }
        }
      }
    },
    "🦞 Морепродукти та риба": {
      "Креветки": {
        "Заморожені (варено-морожені)": {
          "Стандартна": {
            "Великий": 60,
            "Середній": 120,
            "Малий": 180,
            "tip": "Вони вже готові, просто прогрійте їх!"
          }
        },
        "Свіжі (сірі)": {
          "Ніжні": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Щойно стануть рожевими і скрутяться в букву С — виймайте."
          }
        },
        "Коктейльні (дрібні, варено-морожені)": {
          "Стандартна готовність": {
            "Великий": 144,
            "Середній": 180,
            "Малий": 216,
            "tip": "Оптимальний час приготування."
          }
        },
        "Тигрові / Королівські (сиро-морожені, сірі)": {
          "Стандартна готовність": {
            "Великий": 144,
            "Середній": 180,
            "Малий": 216,
            "tip": "Оптимальний час приготування."
          }
        },
        "Тигрові / Королівські (варено-морожені, рожеві)": {
          "Стандартна готовність": {
            "Великий": 144,
            "Середній": 180,
            "Малий": 216,
            "tip": "Оптимальний час приготування."
          }
        },
        "Лангустини (аргентинські креветки)": {
          "Стандартна готовність": {
            "Великий": 144,
            "Середній": 180,
            "Малий": 216,
            "tip": "Оптимальний час приготування."
          }
        }
      },
      "Кальмар": {
        "Тушка": {
          "Ніжний": {
            "Великий": 60,
            "Середній": 90,
            "Малий": 120,
            "tip": "Варіть не більше 2 хвилин, інакше стане гумовим!"
          }
        }
      },
      "Раки": {
        "Дрібні": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Середні": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Великі (відбірні)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        }
      },
      "Кальмари": {
        "Тушки очищені": {
          "Стандартна готовність": {
            "Великий": 144,
            "Середній": 180,
            "Малий": 216,
            "tip": "Оптимальний час приготування."
          }
        },
        "Кільця кальмара": {
          "Стандартна готовність": {
            "Великий": 144,
            "Середній": 180,
            "Малий": 216,
            "tip": "Оптимальний час приготування."
          }
        }
      },
      "Мідії": {
        "У мушлях (цілі)": {
          "Стандартна готовність": {
            "Великий": 144,
            "Середній": 180,
            "Малий": 216,
            "tip": "Оптимальний час приготування."
          }
        },
        "Очищене м'ясо мідій": {
          "Стандартна готовність": {
            "Великий": 144,
            "Середній": 180,
            "Малий": 216,
            "tip": "Оптимальний час приготування."
          }
        }
      },
      "Краби": {
        "Фаланги краба": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Цілий краб": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        }
      },
      "Риба (варіння / припускання)": {
        "Червона риба (стейк або філе сьомги/форелі)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Біла риба (філе тріски, хека, мінтая)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Дрібна річкова риба (для першої закладки в юшку)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        }
      }
    },
    "🌱 Бобові": {
      "Горох": {
        "Цілий сухий": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Колотий (половинки)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Зелений свіжий": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Зелений заморожений": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        }
      },
      "Сочевиця": {
        "Червона / Жовта (швидко розварюється)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Зелена": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Коричнева": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Чорна (Білуга)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        }
      },
      "Квасоля": {
        "Біла звичайна": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Червона (кідні)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Чорна": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        },
        "Стручкова (спаржева, свіжа/морожена)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        }
      },
      "Нут (турецький горох)": {
        "Звичайний сухий (потребує замочування)": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        }
      },
      "Соя": {
        "Боби сої": {
          "Стандартна готовність": {
            "Великий": 720,
            "Середній": 900,
            "Малий": 1080,
            "tip": "Оптимальний час приготування."
          }
        }
      }
    },
    "🍄 Гриби": {
      "Печериці": {
        "Цілі дрібні": {
          "Хрусткі (Бланшовані)": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 600,
            "Середній": 720,
            "Малий": 900,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Нарізані скибочками": {
          "Хрусткі (Бланшовані)": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 600,
            "Середній": 720,
            "Малий": 900,
            "tip": "Легко розминаються виделкою."
          }
        }
      },
      "Лісові гриби (свіжі)": {
        "Білі гриби": {
          "Хрусткі (Бланшовані)": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 600,
            "Середній": 720,
            "Малий": 900,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Підберезники / Підосичники": {
          "Хрусткі (Бланшовані)": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 600,
            "Середній": 720,
            "Малий": 900,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Лисички": {
          "Хрусткі (Бланшовані)": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 600,
            "Середній": 720,
            "Малий": 900,
            "tip": "Легко розминаються виделкою."
          }
        },
        "Опеньки": {
          "Хрусткі (Бланшовані)": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 600,
            "Середній": 720,
            "Малий": 900,
            "tip": "Легко розминаються виделкою."
          }
        }
      },
      "Сушені гриби": {
        "Білі сушені (попередньо розмочені)": {
          "Хрусткі (Бланшовані)": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Збережуть всі вітаміни та колір."
          },
          "М'які (для пюре)": {
            "Великий": 600,
            "Середній": 720,
            "Малий": 900,
            "tip": "Легко розминаються виделкою."
          }
        }
      }
    }
  },
  "Смажити": {
    "🥩 М'ясо та птиця": {
      "Яловичина (Стейк 2-3 см)": {
        "Класичний": {
          "Blue (Сирий зсередини)": {
            "Великий": 120,
            "Середній": 180,
            "Малий": 240,
            "tip": "Лише скоринка ззовні. Температура всередині 46-49°C."
          },
          "Rare (З кров'ю)": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Обсмажте по 1.5 хвилини з кожного боку."
          },
          "Medium Rare (Слабо просмажений)": {
            "Великий": 240,
            "Середній": 300,
            "Малий": 360,
            "tip": "Ідеальний вибір шеф-кухарів! Обсмажте по 2 хвилини з боку."
          },
          "Medium (Середнє просмажування)": {
            "Великий": 360,
            "Середній": 420,
            "Малий": 480,
            "tip": "Світло-рожеве м'ясо. По 3-4 хвилини з кожного боку."
          },
          "Well Done (Повністю готовий)": {
            "Великий": 600,
            "Середній": 720,
            "Малий": 840,
            "tip": "М'ясо може стати жорстким. Смажте на слабшому вогні."
          }
        }
      },
      "Свинина": {
        "Відбивна (Биток)": {
          "Повністю готова": {
            "Великий": 300,
            "Середній": 420,
            "Малий": 540,
            "tip": "Свинину треба добре просмажувати. По 3-4 хвилини з боку."
          }
        },
        "М'якоть (балик, лопатка)": {
          "Medium Rare (З кров'ю)": {
            "Великий": 1080,
            "Середній": 1512,
            "Малий": 2160,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 2160,
            "Середній": 2592,
            "Малий": 3240,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Реберця": {
          "Medium Rare (З кров'ю)": {
            "Великий": 1080,
            "Середній": 1512,
            "Малий": 2160,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 2160,
            "Середній": 2592,
            "Малий": 3240,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Рулька (для холодцю або запікання після варіння)": {
          "Medium Rare (З кров'ю)": {
            "Великий": 1080,
            "Середній": 1512,
            "Малий": 2160,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 2160,
            "Середній": 2592,
            "Малий": 3240,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        }
      },
      "Курка": {
        "Куряче філе (грудка)": {
          "Medium Rare (З кров'ю)": {
            "Великий": 540,
            "Середній": 756,
            "Малий": 1080,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 1080,
            "Середній": 1296,
            "Малий": 1620,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Гомілки / Стегна": {
          "Medium Rare (З кров'ю)": {
            "Великий": 540,
            "Середній": 756,
            "Малий": 1080,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 1080,
            "Середній": 1296,
            "Малий": 1620,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Курячі крильця": {
          "Medium Rare (З кров'ю)": {
            "Великий": 540,
            "Середній": 756,
            "Малий": 1080,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 1080,
            "Середній": 1296,
            "Малий": 1620,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Ціла тушка бройлера": {
          "Medium Rare (З кров'ю)": {
            "Великий": 540,
            "Середній": 756,
            "Малий": 1080,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 1080,
            "Середній": 1296,
            "Малий": 1620,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Домашня курка (для довгого варіння юшки)": {
          "Medium Rare (З кров'ю)": {
            "Великий": 540,
            "Середній": 756,
            "Малий": 1080,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 1080,
            "Середній": 1296,
            "Малий": 1620,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        }
      },
      "Індичка": {
        "Філе індички": {
          "Medium Rare (З кров'ю)": {
            "Великий": 540,
            "Середній": 756,
            "Малий": 1080,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 1080,
            "Середній": 1296,
            "Малий": 1620,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Індича гомілка": {
          "Medium Rare (З кров'ю)": {
            "Великий": 540,
            "Середній": 756,
            "Малий": 1080,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 1080,
            "Середній": 1296,
            "Малий": 1620,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Крила": {
          "Medium Rare (З кров'ю)": {
            "Великий": 540,
            "Середній": 756,
            "Малий": 1080,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 1080,
            "Середній": 1296,
            "Малий": 1620,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        }
      },
      "Яловичина / Телятина": {
        "М'якоть шматком (для салатів чи борщу)": {
          "Medium Rare (З кров'ю)": {
            "Великий": 1080,
            "Середній": 1512,
            "Малий": 2160,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 2160,
            "Середній": 2592,
            "Малий": 3240,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "М'ясо на кістці (грудинка, ребра для бульйону)": {
          "Medium Rare (З кров'ю)": {
            "Великий": 1080,
            "Середній": 1512,
            "Малий": 2160,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 2160,
            "Середній": 2592,
            "Малий": 3240,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        }
      },
      "Субпродукти": {
        "Печінка куряча": {
          "Medium Rare (З кров'ю)": {
            "Великий": 270,
            "Середній": 378,
            "Малий": 540,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 540,
            "Середній": 648,
            "Малий": 810,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Печінка яловича / свиняча": {
          "Medium Rare (З кров'ю)": {
            "Великий": 270,
            "Середній": 378,
            "Малий": 540,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 540,
            "Середній": 648,
            "Малий": 810,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Курячі серця та шлуночки": {
          "Medium Rare (З кров'ю)": {
            "Великий": 270,
            "Середній": 378,
            "Малий": 540,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 540,
            "Середній": 648,
            "Малий": 810,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Язик яловичий": {
          "Medium Rare (З кров'ю)": {
            "Великий": 270,
            "Середній": 378,
            "Малий": 540,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 540,
            "Середній": 648,
            "Малий": 810,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Язик свинячий": {
          "Medium Rare (З кров'ю)": {
            "Великий": 270,
            "Середній": 378,
            "Малий": 540,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 540,
            "Середній": 648,
            "Малий": 810,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        }
      },
      "Ковбасні вироби": {
        "Сосиски тонкі": {
          "Medium Rare (З кров'ю)": {
            "Великий": 270,
            "Середній": 378,
            "Малий": 540,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 540,
            "Середній": 648,
            "Малий": 810,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Сардельки класичні": {
          "Medium Rare (З кров'ю)": {
            "Великий": 270,
            "Середній": 378,
            "Малий": 540,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 540,
            "Середній": 648,
            "Малий": 810,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        },
        "Шпикачки": {
          "Medium Rare (З кров'ю)": {
            "Великий": 270,
            "Середній": 378,
            "Малий": 540,
            "tip": "Смажте на добре розігрітій сковороді."
          },
          "Well Done (Просмажене)": {
            "Великий": 540,
            "Середній": 648,
            "Малий": 810,
            "tip": "Після обсмажування зменшіть вогонь."
          }
        }
      }
    },
    "🍗 Птиця": {
      "Курка": {
        "Філе (шматочки)": {
          "Золотиста скоринка": {
            "Великий": 300,
            "Середній": 420,
            "Малий": 540,
            "tip": "Швидко обсмажте, щоб не пересушити."
          }
        },
        "Крильця": {
          "Хрусткі": {
            "Великий": 600,
            "Середній": 900,
            "Малий": 1200,
            "tip": "Смажте у фритюрі або у великій кількості олії."
          }
        }
      }
    },
    "🥚 Яйця": {
      "Курячі": {
        "Оката яєчня": {
          "Рідкий жовток": {
            "Великий": 120,
            "Середній": 180,
            "Малий": 240,
            "tip": "Не накривайте кришкою, щоб жовток залишився жовтим."
          },
          "Твердий жовток": {
            "Великий": 240,
            "Середній": 300,
            "Малий": 360,
            "tip": "Накрийте кришкою на останні 2 хвилини."
          }
        },
        "Омлет": {
          "Ніжний": {
            "Великий": 180,
            "Середній": 240,
            "Малий": 300,
            "tip": "Смажте під кришкою на слабкому вогні."
          }
        },
        "Некруте (в смятку)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "В мішечок": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Круте (в круту)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Пашот": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Перепелині": {
        "Звичайні (круті / некруті)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Страусині": {
        "Ціле (велике)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      }
    },
    "🥔 Овочі та коренеплоди": {
      "Картопля": {
        "Нарізана соломкою": {
          "Легка скоринка": {
            "Великий": 600,
            "Середній": 900,
            "Малий": 1200,
            "tip": "Не соліть на початку, інакше вона розпадеться!"
          },
          "Сильно засмажена": {
            "Великий": 900,
            "Середній": 1200,
            "Малий": 1500,
            "tip": "Смажте малими порціями в один шар."
          }
        },
        "В мундирі (ціла)": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Очищена (ціла)": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Шматочками / кубиками (для супу)": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Молода дрібна": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Печериці": {
        "Слайси": {
          "Золотисті": {
            "Великий": 300,
            "Середній": 420,
            "Малий": 600,
            "tip": "Смажте без кришки, щоб випарувалася вся вода."
          }
        }
      },
      "Морква": {
        "Ціла очищена": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Нарізана кубиками або соломкою": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Буряк": {
        "Цілий дрібний": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Цілий великий": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Нарізаний або натертий": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Капуста": {
        "Броколі (суцвіття)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Цвітна капуста (суцвіття)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Брюссельська (міні-качанчики)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Білокачанна (нарізана шматочками / нашаткована)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Кукурудзяні качани": {
        "Молоді цукрові": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Старі / кормові": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Зерна кукурудзи (свіжі/морожені)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Спаржа (Asparagus)": {
        "Зелена": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Біла": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Кабачки та гарбузові": {
        "Кабачок / Цукіні (кільцями)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Гарбуз (кубиками)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      }
    },
    "🥞 Борошняне": {
      "Млинці": {
        "Тонкі": {
          "Стандартна": {
            "Великий": 90,
            "Середній": 120,
            "Малий": 180,
            "tip": "По 1 хвилині з першого боку і 30 секунд з іншого."
          }
        }
      },
      "Сирники": {
        "Товсті": {
          "Рум'яні": {
            "Великий": 240,
            "Середній": 300,
            "Малий": 420,
            "tip": "Смажте під кришкою на слабкому вогні, щоб пропеклися всередині."
          }
        }
      }
    },
    "🌾 Крупи та злаки": {
      "Гречка": {
        "Звичайна (ядриця)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Зелена (необсмажена)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Проділ (січка)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "У пакетиках для варіння": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Рис": {
        "Білий довгозерний": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Білий круглозерний": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Басматі": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Жасмин": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Бурий (неочищений)": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Дикий (чорний)": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Червоний": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Спеціальний для суші (короткозерний)": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Арборіо (для різотто)": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        },
        "Пропарений": {
          "Легка золотиста скоринка": {
            "Великий": 503,
            "Середній": 720,
            "Малий": 864,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 720,
            "Середній": 936,
            "Малий": 1152,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Вівсянка": {
        "Пластівці швидкого приготування (екстра)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Плющена традиційна (Геркулес)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Цільнозернова крупа": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Булгур": {
        "Дрібний (коатлик)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Середній": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Великий (пілавлік)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Кускус": {
        "Звичайний (дрібний)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Птітім (ізраїльський, великі кульки)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Кіноа": {
        "Біла": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Червона": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Чорна": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Мікс (триколірна)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Пшоно": {
        "Звичайне шліфоване": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Кукурудзяна крупа": {
        "Дрібного помелу (для поленти та баноша)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Грубого помелу": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Манка": {
        "Традиційна (марка М)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Семуліна (із твердих сортів пшениці)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Перловка": {
        "Звичайна ячмінна": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Голландка (сильно шліфована)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      }
    },
    "🌱 Бобові": {
      "Горох": {
        "Цілий сухий": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Колотий (половинки)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Зелений свіжий": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Зелений заморожений": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Сочевиця": {
        "Червона / Жовта (швидко розварюється)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Зелена": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Коричнева": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Чорна (Білуга)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Квасоля": {
        "Біла звичайна": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Червона (кідні)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Чорна": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Стручкова (спаржева, свіжа/морожена)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Нут (турецький горох)": {
        "Звичайний сухий (потребує замочування)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Соя": {
        "Боби сої": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      }
    },
    "🍝 Макаронні вироби та тісто": {
      "Класичні макарони (з твердих сортів)": {
        "Спагеті (Spaghetti)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Пенне / Пір'я (Penne)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Фарфалле / Метелики (Farfalle)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Фузіллі / Спіральки (Fusilli)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Феттуччіні / Гнізда (Fettuccine)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Ріжки (Maccheroni)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Лазанья (листи для відварювання)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Азійська локшина": {
        "Удон (пшенична)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Соба (гречана)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Рисова локшина": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Фунчоза (скляна локшина)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Яєчна локшина": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Напівфабрикати з тіста": {
        "Пельмені (з м'ясом)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Вареники з картоплею": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Вареники з сиром (солодкі/солоні)": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Вареники з вишнею": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Хінкалі": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Равіолі": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        },
        "Галушки": {
          "Легка золотиста скоринка": {
            "Великий": 201,
            "Середній": 288,
            "Малий": 345,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 288,
            "Середній": 374,
            "Малий": 460,
            "tip": "Смажте в один шар."
          }
        }
      }
    },
    "🦞 Морепродукти та риба": {
      "Раки": {
        "Дрібні": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Середні": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Великі (відбірні)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Креветки": {
        "Коктейльні (дрібні, варено-морожені)": {
          "Легка золотиста скоринка": {
            "Великий": 75,
            "Середній": 108,
            "Малий": 129,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 108,
            "Середній": 140,
            "Малий": 172,
            "tip": "Смажте в один шар."
          }
        },
        "Тигрові / Королівські (сиро-морожені, сірі)": {
          "Легка золотиста скоринка": {
            "Великий": 75,
            "Середній": 108,
            "Малий": 129,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 108,
            "Середній": 140,
            "Малий": 172,
            "tip": "Смажте в один шар."
          }
        },
        "Тигрові / Королівські (варено-морожені, рожеві)": {
          "Легка золотиста скоринка": {
            "Великий": 75,
            "Середній": 108,
            "Малий": 129,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 108,
            "Середній": 140,
            "Малий": 172,
            "tip": "Смажте в один шар."
          }
        },
        "Лангустини (аргентинські креветки)": {
          "Легка золотиста скоринка": {
            "Великий": 75,
            "Середній": 108,
            "Малий": 129,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 108,
            "Середній": 140,
            "Малий": 172,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Кальмари": {
        "Тушки очищені": {
          "Легка золотиста скоринка": {
            "Великий": 75,
            "Середній": 108,
            "Малий": 129,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 108,
            "Середній": 140,
            "Малий": 172,
            "tip": "Смажте в один шар."
          }
        },
        "Кільця кальмара": {
          "Легка золотиста скоринка": {
            "Великий": 75,
            "Середній": 108,
            "Малий": 129,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 108,
            "Середній": 140,
            "Малий": 172,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Мідії": {
        "У мушлях (цілі)": {
          "Легка золотиста скоринка": {
            "Великий": 75,
            "Середній": 108,
            "Малий": 129,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 108,
            "Середній": 140,
            "Малий": 172,
            "tip": "Смажте в один шар."
          }
        },
        "Очищене м'ясо мідій": {
          "Легка золотиста скоринка": {
            "Великий": 75,
            "Середній": 108,
            "Малий": 129,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 108,
            "Середній": 140,
            "Малий": 172,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Краби": {
        "Фаланги краба": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Цілий краб": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Риба (варіння / припускання)": {
        "Червона риба (стейк або філе сьомги/форелі)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Біла риба (філе тріски, хека, мінтая)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        },
        "Дрібна річкова риба (для першої закладки в юшку)": {
          "Легка золотиста скоринка": {
            "Великий": 378,
            "Середній": 540,
            "Малий": 648,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 540,
            "Середній": 702,
            "Малий": 864,
            "tip": "Смажте в один шар."
          }
        }
      }
    },
    "🍄 Гриби": {
      "Печериці": {
        "Цілі дрібні": {
          "Легка золотиста скоринка": {
            "Великий": 251,
            "Середній": 360,
            "Малий": 432,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 360,
            "Середній": 468,
            "Малий": 576,
            "tip": "Смажте в один шар."
          }
        },
        "Нарізані скибочками": {
          "Легка золотиста скоринка": {
            "Великий": 251,
            "Середній": 360,
            "Малий": 432,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 360,
            "Середній": 468,
            "Малий": 576,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Лісові гриби (свіжі)": {
        "Білі гриби": {
          "Легка золотиста скоринка": {
            "Великий": 251,
            "Середній": 360,
            "Малий": 432,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 360,
            "Середній": 468,
            "Малий": 576,
            "tip": "Смажте в один шар."
          }
        },
        "Підберезники / Підосичники": {
          "Легка золотиста скоринка": {
            "Великий": 251,
            "Середній": 360,
            "Малий": 432,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 360,
            "Середній": 468,
            "Малий": 576,
            "tip": "Смажте в один шар."
          }
        },
        "Лисички": {
          "Легка золотиста скоринка": {
            "Великий": 251,
            "Середній": 360,
            "Малий": 432,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 360,
            "Середній": 468,
            "Малий": 576,
            "tip": "Смажте в один шар."
          }
        },
        "Опеньки": {
          "Легка золотиста скоринка": {
            "Великий": 251,
            "Середній": 360,
            "Малий": 432,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 360,
            "Середній": 468,
            "Малий": 576,
            "tip": "Смажте в один шар."
          }
        }
      },
      "Сушені гриби": {
        "Білі сушені (попередньо розмочені)": {
          "Легка золотиста скоринка": {
            "Великий": 251,
            "Середній": 360,
            "Малий": 432,
            "tip": "Часто помішуйте."
          },
          "Хрустка і засмажена": {
            "Великий": 360,
            "Середній": 468,
            "Малий": 576,
            "tip": "Смажте в один шар."
          }
        }
      }
    }
  },
  "Запікати": {
    "🍗 Птиця": {
      "Курка цілком": {
        "Бройлер (1.5 - 2 кг)": {
          "Соковита з хрусткою скоринкою": {
            "Великий (220°C)": 3600,
            "Середній (180°C)": 5400,
            "Малий (160°C)": 7200,
            "tip": "Запікайте 1 годину 30 хвилин. Останні 15 хв зніміть фольгу."
          }
        }
      },
      "Качка цілком": {
        "Звичайна": {
          "Пропечена": {
            "Великий (220°C)": 5400,
            "Середній (180°C)": 7200,
            "Малий (160°C)": 9000,
            "tip": "Проколіть шкіру виделкою, щоб витікав жир."
          }
        }
      }
    },
    "🥩 М'ясо та птиця": {
      "Свинина": {
        "Шматком (Буженина)": {
          "Повністю готова": {
            "Великий (220°C)": 3600,
            "Середній (180°C)": 5400,
            "Малий (160°C)": 7200,
            "tip": "Запікайте у фользі або рукаві."
          }
        },
        "М'якоть (балик, лопатка)": {
          "Ніжна текстура": {
            "Великий (220°C)": 6300,
            "Середній (180°C)": 9000,
            "Малий (160°C)": 11700,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 8100,
            "Середній (180°C)": 10800,
            "Малий (160°C)": 13500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Реберця": {
          "Ніжна текстура": {
            "Великий (220°C)": 6300,
            "Середній (180°C)": 9000,
            "Малий (160°C)": 11700,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 8100,
            "Середній (180°C)": 10800,
            "Малий (160°C)": 13500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Рулька (для холодцю або запікання після варіння)": {
          "Ніжна текстура": {
            "Великий (220°C)": 6300,
            "Середній (180°C)": 9000,
            "Малий (160°C)": 11700,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 8100,
            "Середній (180°C)": 10800,
            "Малий (160°C)": 13500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Курка": {
        "Куряче філе (грудка)": {
          "Ніжна текстура": {
            "Великий (220°C)": 3150,
            "Середній (180°C)": 4500,
            "Малий (160°C)": 5850,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 4050,
            "Середній (180°C)": 5400,
            "Малий (160°C)": 6750,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Гомілки / Стегна": {
          "Ніжна текстура": {
            "Великий (220°C)": 3150,
            "Середній (180°C)": 4500,
            "Малий (160°C)": 5850,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 4050,
            "Середній (180°C)": 5400,
            "Малий (160°C)": 6750,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Курячі крильця": {
          "Ніжна текстура": {
            "Великий (220°C)": 3150,
            "Середній (180°C)": 4500,
            "Малий (160°C)": 5850,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 4050,
            "Середній (180°C)": 5400,
            "Малий (160°C)": 6750,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Ціла тушка бройлера": {
          "Ніжна текстура": {
            "Великий (220°C)": 3150,
            "Середній (180°C)": 4500,
            "Малий (160°C)": 5850,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 4050,
            "Середній (180°C)": 5400,
            "Малий (160°C)": 6750,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Домашня курка (для довгого варіння юшки)": {
          "Ніжна текстура": {
            "Великий (220°C)": 3150,
            "Середній (180°C)": 4500,
            "Малий (160°C)": 5850,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 4050,
            "Середній (180°C)": 5400,
            "Малий (160°C)": 6750,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Індичка": {
        "Філе індички": {
          "Ніжна текстура": {
            "Великий (220°C)": 3150,
            "Середній (180°C)": 4500,
            "Малий (160°C)": 5850,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 4050,
            "Середній (180°C)": 5400,
            "Малий (160°C)": 6750,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Індича гомілка": {
          "Ніжна текстура": {
            "Великий (220°C)": 3150,
            "Середній (180°C)": 4500,
            "Малий (160°C)": 5850,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 4050,
            "Середній (180°C)": 5400,
            "Малий (160°C)": 6750,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Крила": {
          "Ніжна текстура": {
            "Великий (220°C)": 3150,
            "Середній (180°C)": 4500,
            "Малий (160°C)": 5850,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 4050,
            "Середній (180°C)": 5400,
            "Малий (160°C)": 6750,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Яловичина / Телятина": {
        "М'якоть шматком (для салатів чи борщу)": {
          "Ніжна текстура": {
            "Великий (220°C)": 6300,
            "Середній (180°C)": 9000,
            "Малий (160°C)": 11700,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 8100,
            "Середній (180°C)": 10800,
            "Малий (160°C)": 13500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "М'ясо на кістці (грудинка, ребра для бульйону)": {
          "Ніжна текстура": {
            "Великий (220°C)": 6300,
            "Середній (180°C)": 9000,
            "Малий (160°C)": 11700,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 8100,
            "Середній (180°C)": 10800,
            "Малий (160°C)": 13500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Субпродукти": {
        "Печінка куряча": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Печінка яловича / свиняча": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Курячі серця та шлуночки": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Язик яловичий": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Язик свинячий": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Ковбасні вироби": {
        "Сосиски тонкі": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Сардельки класичні": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Шпикачки": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      }
    },
    "🥔 Овочі та коренеплоди": {
      "Картопля": {
        "По-селянськи": {
          "Золотиста скоринка": {
            "Великий (220°C)": 1500,
            "Середній (180°C)": 2100,
            "Малий (160°C)": 2700,
            "tip": "Обов'язково обваляйте в олії з паприкою."
          }
        },
        "В мундирі (ціла)": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Очищена (ціла)": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Шматочками / кубиками (для супу)": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Молода дрібна": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Батат (Солодка картопля)": {
        "Скибочками": {
          "Ніжний": {
            "Великий (220°C)": 1200,
            "Середній (180°C)": 1800,
            "Малий (160°C)": 2400,
            "tip": "Не перетримуйте, бо він швидко згорає."
          }
        }
      },
      "Морква": {
        "Ціла очищена": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Нарізана кубиками або соломкою": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Буряк": {
        "Цілий дрібний": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Цілий великий": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Нарізаний або натертий": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Капуста": {
        "Броколі (суцвіття)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Цвітна капуста (суцвіття)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Брюссельська (міні-качанчики)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Білокачанна (нарізана шматочками / нашаткована)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Кукурудзяні качани": {
        "Молоді цукрові": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Старі / кормові": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Зерна кукурудзи (свіжі/морожені)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Спаржа (Asparagus)": {
        "Зелена": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Біла": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Кабачки та гарбузові": {
        "Кабачок / Цукіні (кільцями)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Гарбуз (кубиками)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      }
    },
    "🍕 Випічка та запіканки": {
      "Піца": {
        "Тонке тісто": {
          "Рум'яні бортики": {
            "Великий (220°C)": 420,
            "Середній (180°C)": 600,
            "Малий (160°C)": 900,
            "tip": "У професійних печах піца готується за 2 хвилини при 400°C!"
          }
        }
      }
    },
    "🌾 Крупи та злаки": {
      "Гречка": {
        "Звичайна (ядриця)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Зелена (необсмажена)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Проділ (січка)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "У пакетиках для варіння": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Рис": {
        "Білий довгозерний": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Білий круглозерний": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Басматі": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Жасмин": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Бурий (неочищений)": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Дикий (чорний)": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Червоний": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Спеціальний для суші (короткозерний)": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Арборіо (для різотто)": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Пропарений": {
          "Ніжна текстура": {
            "Великий (220°C)": 2100,
            "Середній (180°C)": 3000,
            "Малий (160°C)": 3900,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2700,
            "Середній (180°C)": 3600,
            "Малий (160°C)": 4500,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Вівсянка": {
        "Пластівці швидкого приготування (екстра)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Плющена традиційна (Геркулес)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Цільнозернова крупа": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Булгур": {
        "Дрібний (коатлик)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Середній": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Великий (пілавлік)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Кускус": {
        "Звичайний (дрібний)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Птітім (ізраїльський, великі кульки)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Кіноа": {
        "Біла": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Червона": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Чорна": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Мікс (триколірна)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Пшоно": {
        "Звичайне шліфоване": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Кукурудзяна крупа": {
        "Дрібного помелу (для поленти та баноша)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Грубого помелу": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Манка": {
        "Традиційна (марка М)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Семуліна (із твердих сортів пшениці)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Перловка": {
        "Звичайна ячмінна": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Голландка (сильно шліфована)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      }
    },
    "🌱 Бобові": {
      "Горох": {
        "Цілий сухий": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Колотий (половинки)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Зелений свіжий": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Зелений заморожений": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Сочевиця": {
        "Червона / Жовта (швидко розварюється)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Зелена": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Коричнева": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Чорна (Білуга)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Квасоля": {
        "Біла звичайна": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Червона (кідні)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Чорна": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Стручкова (спаржева, свіжа/морожена)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Нут (турецький горох)": {
        "Звичайний сухий (потребує замочування)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Соя": {
        "Боби сої": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      }
    },
    "🍝 Макаронні вироби та тісто": {
      "Класичні макарони (з твердих сортів)": {
        "Спагеті (Spaghetti)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Пенне / Пір'я (Penne)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Фарфалле / Метелики (Farfalle)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Фузіллі / Спіральки (Fusilli)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Феттуччіні / Гнізда (Fettuccine)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Ріжки (Maccheroni)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Лазанья (листи для відварювання)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Азійська локшина": {
        "Удон (пшенична)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Соба (гречана)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Рисова локшина": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Фунчоза (скляна локшина)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Яєчна локшина": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Напівфабрикати з тіста": {
        "Пельмені (з м'ясом)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Вареники з картоплею": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Вареники з сиром (солодкі/солоні)": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Вареники з вишнею": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Хінкалі": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Равіолі": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Галушки": {
          "Ніжна текстура": {
            "Великий (220°C)": 840,
            "Середній (180°C)": 1200,
            "Малий (160°C)": 1560,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1080,
            "Середній (180°C)": 1440,
            "Малий (160°C)": 1800,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      }
    },
    "🥚 Яйця": {
      "Курячі": {
        "Некруте (в смятку)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "В мішечок": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Круте (в круту)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Пашот": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Перепелині": {
        "Звичайні (круті / некруті)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Страусині": {
        "Ціле (велике)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      }
    },
    "🦞 Морепродукти та риба": {
      "Раки": {
        "Дрібні": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Середні": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Великі (відбірні)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Креветки": {
        "Коктейльні (дрібні, варено-морожені)": {
          "Ніжна текстура": {
            "Великий (220°C)": 315,
            "Середній (180°C)": 450,
            "Малий (160°C)": 585,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 405,
            "Середній (180°C)": 540,
            "Малий (160°C)": 675,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Тигрові / Королівські (сиро-морожені, сірі)": {
          "Ніжна текстура": {
            "Великий (220°C)": 315,
            "Середній (180°C)": 450,
            "Малий (160°C)": 585,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 405,
            "Середній (180°C)": 540,
            "Малий (160°C)": 675,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Тигрові / Королівські (варено-морожені, рожеві)": {
          "Ніжна текстура": {
            "Великий (220°C)": 315,
            "Середній (180°C)": 450,
            "Малий (160°C)": 585,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 405,
            "Середній (180°C)": 540,
            "Малий (160°C)": 675,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Лангустини (аргентинські креветки)": {
          "Ніжна текстура": {
            "Великий (220°C)": 315,
            "Середній (180°C)": 450,
            "Малий (160°C)": 585,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 405,
            "Середній (180°C)": 540,
            "Малий (160°C)": 675,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Кальмари": {
        "Тушки очищені": {
          "Ніжна текстура": {
            "Великий (220°C)": 315,
            "Середній (180°C)": 450,
            "Малий (160°C)": 585,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 405,
            "Середній (180°C)": 540,
            "Малий (160°C)": 675,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Кільця кальмара": {
          "Ніжна текстура": {
            "Великий (220°C)": 315,
            "Середній (180°C)": 450,
            "Малий (160°C)": 585,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 405,
            "Середній (180°C)": 540,
            "Малий (160°C)": 675,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Мідії": {
        "У мушлях (цілі)": {
          "Ніжна текстура": {
            "Великий (220°C)": 315,
            "Середній (180°C)": 450,
            "Малий (160°C)": 585,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 405,
            "Середній (180°C)": 540,
            "Малий (160°C)": 675,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Очищене м'ясо мідій": {
          "Ніжна текстура": {
            "Великий (220°C)": 315,
            "Середній (180°C)": 450,
            "Малий (160°C)": 585,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 405,
            "Середній (180°C)": 540,
            "Малий (160°C)": 675,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Краби": {
        "Фаланги краба": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Цілий краб": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Риба (варіння / припускання)": {
        "Червона риба (стейк або філе сьомги/форелі)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Біла риба (філе тріски, хека, мінтая)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Дрібна річкова риба (для першої закладки в юшку)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1575,
            "Середній (180°C)": 2250,
            "Малий (160°C)": 2925,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 2025,
            "Середній (180°C)": 2700,
            "Малий (160°C)": 3375,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      }
    },
    "🍄 Гриби": {
      "Печериці": {
        "Цілі дрібні": {
          "Ніжна текстура": {
            "Великий (220°C)": 1050,
            "Середній (180°C)": 1500,
            "Малий (160°C)": 1950,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1350,
            "Середній (180°C)": 1800,
            "Малий (160°C)": 2250,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Нарізані скибочками": {
          "Ніжна текстура": {
            "Великий (220°C)": 1050,
            "Середній (180°C)": 1500,
            "Малий (160°C)": 1950,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1350,
            "Середній (180°C)": 1800,
            "Малий (160°C)": 2250,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Лісові гриби (свіжі)": {
        "Білі гриби": {
          "Ніжна текстура": {
            "Великий (220°C)": 1050,
            "Середній (180°C)": 1500,
            "Малий (160°C)": 1950,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1350,
            "Середній (180°C)": 1800,
            "Малий (160°C)": 2250,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Підберезники / Підосичники": {
          "Ніжна текстура": {
            "Великий (220°C)": 1050,
            "Середній (180°C)": 1500,
            "Малий (160°C)": 1950,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1350,
            "Середній (180°C)": 1800,
            "Малий (160°C)": 2250,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Лисички": {
          "Ніжна текстура": {
            "Великий (220°C)": 1050,
            "Середній (180°C)": 1500,
            "Малий (160°C)": 1950,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1350,
            "Середній (180°C)": 1800,
            "Малий (160°C)": 2250,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        },
        "Опеньки": {
          "Ніжна текстура": {
            "Великий (220°C)": 1050,
            "Середній (180°C)": 1500,
            "Малий (160°C)": 1950,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1350,
            "Середній (180°C)": 1800,
            "Малий (160°C)": 2250,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      },
      "Сушені гриби": {
        "Білі сушені (попередньо розмочені)": {
          "Ніжна текстура": {
            "Великий (220°C)": 1050,
            "Середній (180°C)": 1500,
            "Малий (160°C)": 1950,
            "tip": "Запікайте у фользі або рукаві."
          },
          "Хрустка скоринка": {
            "Великий (220°C)": 1350,
            "Середній (180°C)": 1800,
            "Малий (160°C)": 2250,
            "tip": "Зніміть фольгу на останні 15 хвилин."
          }
        }
      }
    }
  }
};
